HloModule pmap_simulate_until_output.597

%jit__pad__4.30 (parameter.31: f32[1031,1024], parameter.32: s32[]) -> (f32[1032,1024]) {
  %constant.33 = pred[] constant(false)
  %parameter.31 = f32[1031,1024]{1,0} parameter(0)
  %parameter.32 = s32[] parameter(1)
  %broadcast.34 = s32[2,2]{1,0} broadcast(s32[] %parameter.32), dimensions={}, metadata={op_type="broadcast_in_dim" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/broadcast_in_dim[ broadcast_dimensions=(  )\n                                                                                                                      shape=(2, 2) ]" source_file="wave_equation.py" source_line=109}
  %convert.35 = f32[2,2]{1,0} convert(s32[2,2]{1,0} %broadcast.34), metadata={op_type="convert_element_type" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/convert_element_type[ new_dtype=float32\n                                                                                                                          weak_type=False ]" source_file="wave_equation.py" source_line=109}
  %constant.36 = s32[] constant(0), metadata={op_type="lt" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/lt" source_file="wave_equation.py" source_line=109}
  %constant.37 = s32[] constant(0), metadata={op_type="lt" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/lt" source_file="wave_equation.py" source_line=109}
  %compare.38 = pred[] compare(s32[] %constant.36, s32[] %constant.37), direction=LT, metadata={op_type="lt" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/lt" source_file="wave_equation.py" source_line=109}
  %constant.39 = s32[] constant(0), metadata={op_type="add" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/add" source_file="wave_equation.py" source_line=109}
  %constant.40 = s32[] constant(2), metadata={op_type="add" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/add" source_file="wave_equation.py" source_line=109}
  %add.41 = s32[] add(s32[] %constant.39, s32[] %constant.40), metadata={op_type="add" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/add" source_file="wave_equation.py" source_line=109}
  %constant.42 = s32[] constant(0), metadata={op_type="select" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/select" source_file="wave_equation.py" source_line=109}
  %select.43 = s32[] select(pred[] %compare.38, s32[] %add.41, s32[] %constant.42), metadata={op_type="select" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/select" source_file="wave_equation.py" source_line=109}
  %broadcast.52 = s32[1]{0} broadcast(s32[] %select.43), dimensions={}, metadata={op_type="broadcast_in_dim" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/broadcast_in_dim[ broadcast_dimensions=(  )\n                                                                                                                      shape=(1,) ]" source_file="wave_equation.py" source_line=109}
  %constant.44 = s32[] constant(0), metadata={op_type="lt" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/lt" source_file="wave_equation.py" source_line=109}
  %constant.45 = s32[] constant(0), metadata={op_type="lt" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/lt" source_file="wave_equation.py" source_line=109}
  %compare.46 = pred[] compare(s32[] %constant.44, s32[] %constant.45), direction=LT, metadata={op_type="lt" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/lt" source_file="wave_equation.py" source_line=109}
  %constant.47 = s32[] constant(0), metadata={op_type="add" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/add" source_file="wave_equation.py" source_line=109}
  %constant.48 = s32[] constant(2), metadata={op_type="add" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/add" source_file="wave_equation.py" source_line=109}
  %add.49 = s32[] add(s32[] %constant.47, s32[] %constant.48), metadata={op_type="add" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/add" source_file="wave_equation.py" source_line=109}
  %constant.50 = s32[] constant(0), metadata={op_type="select" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/select" source_file="wave_equation.py" source_line=109}
  %select.51 = s32[] select(pred[] %compare.46, s32[] %add.49, s32[] %constant.50), metadata={op_type="select" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/select" source_file="wave_equation.py" source_line=109}
  %broadcast.53 = s32[1]{0} broadcast(s32[] %select.51), dimensions={}, metadata={op_type="broadcast_in_dim" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/broadcast_in_dim[ broadcast_dimensions=(  )\n                                                                                                                      shape=(1,) ]" source_file="wave_equation.py" source_line=109}
  %concatenate.54 = s32[2]{0} concatenate(s32[1]{0} %broadcast.52, s32[1]{0} %broadcast.53), dimensions={0}, metadata={op_type="concatenate" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/concatenate[ dimension=0 ]" source_file="wave_equation.py" source_line=109}
  %gather.55 = f32[] gather(f32[2,2]{1,0} %convert.35, s32[2]{0} %concatenate.54), offset_dims={}, collapsed_slice_dims={0,1}, start_index_map={0,1}, index_vector_dim=0, slice_sizes={1,1}, indices_are_sorted=true, metadata={op_type="gather" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/gather[ dimension_numbers=GatherDimensionNumbers(offset_dims=(), collapsed_slice_dims=(0, 1), start_index_map=(0, 1))\n                                                                                                            indices_are_sorted=True\n                                                                                                            slice_sizes=(1, 1)\n                                                                                                            unique_indices=True ]" source_file="wave_equation.py" source_line=109}
  %pad.56 = f32[1031,1024]{1,0} pad(f32[1031,1024]{1,0} %parameter.31, f32[] %gather.55), padding=0_0x0_0, metadata={op_type="pad" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/pad[ padding_config=((0, 0, 0), (0, 0, 0)) ]" source_file="wave_equation.py" source_line=109}
  %constant.57 = s32[] constant(0), metadata={op_type="lt" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/lt" source_file="wave_equation.py" source_line=109}
  %constant.58 = s32[] constant(0), metadata={op_type="lt" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/lt" source_file="wave_equation.py" source_line=109}
  %compare.59 = pred[] compare(s32[] %constant.57, s32[] %constant.58), direction=LT, metadata={op_type="lt" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/lt" source_file="wave_equation.py" source_line=109}
  %constant.60 = s32[] constant(0), metadata={op_type="add" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/add" source_file="wave_equation.py" source_line=109}
  %constant.61 = s32[] constant(2), metadata={op_type="add" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/add" source_file="wave_equation.py" source_line=109}
  %add.62 = s32[] add(s32[] %constant.60, s32[] %constant.61), metadata={op_type="add" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/add" source_file="wave_equation.py" source_line=109}
  %constant.63 = s32[] constant(0), metadata={op_type="select" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/select" source_file="wave_equation.py" source_line=109}
  %select.64 = s32[] select(pred[] %compare.59, s32[] %add.62, s32[] %constant.63), metadata={op_type="select" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/select" source_file="wave_equation.py" source_line=109}
  %broadcast.73 = s32[1]{0} broadcast(s32[] %select.64), dimensions={}, metadata={op_type="broadcast_in_dim" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/broadcast_in_dim[ broadcast_dimensions=(  )\n                                                                                                                      shape=(1,) ]" source_file="wave_equation.py" source_line=109}
  %constant.65 = s32[] constant(1), metadata={op_type="lt" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/lt" source_file="wave_equation.py" source_line=109}
  %constant.66 = s32[] constant(0), metadata={op_type="lt" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/lt" source_file="wave_equation.py" source_line=109}
  %compare.67 = pred[] compare(s32[] %constant.65, s32[] %constant.66), direction=LT, metadata={op_type="lt" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/lt" source_file="wave_equation.py" source_line=109}
  %constant.68 = s32[] constant(1), metadata={op_type="add" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/add" source_file="wave_equation.py" source_line=109}
  %constant.69 = s32[] constant(2), metadata={op_type="add" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/add" source_file="wave_equation.py" source_line=109}
  %add.70 = s32[] add(s32[] %constant.68, s32[] %constant.69), metadata={op_type="add" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/add" source_file="wave_equation.py" source_line=109}
  %constant.71 = s32[] constant(1), metadata={op_type="select" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/select" source_file="wave_equation.py" source_line=109}
  %select.72 = s32[] select(pred[] %compare.67, s32[] %add.70, s32[] %constant.71), metadata={op_type="select" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/select" source_file="wave_equation.py" source_line=109}
  %broadcast.74 = s32[1]{0} broadcast(s32[] %select.72), dimensions={}, metadata={op_type="broadcast_in_dim" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/broadcast_in_dim[ broadcast_dimensions=(  )\n                                                                                                                      shape=(1,) ]" source_file="wave_equation.py" source_line=109}
  %concatenate.75 = s32[2]{0} concatenate(s32[1]{0} %broadcast.73, s32[1]{0} %broadcast.74), dimensions={0}, metadata={op_type="concatenate" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/concatenate[ dimension=0 ]" source_file="wave_equation.py" source_line=109}
  %gather.76 = f32[] gather(f32[2,2]{1,0} %convert.35, s32[2]{0} %concatenate.75), offset_dims={}, collapsed_slice_dims={0,1}, start_index_map={0,1}, index_vector_dim=0, slice_sizes={1,1}, indices_are_sorted=true, metadata={op_type="gather" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/gather[ dimension_numbers=GatherDimensionNumbers(offset_dims=(), collapsed_slice_dims=(0, 1), start_index_map=(0, 1))\n                                                                                                            indices_are_sorted=True\n                                                                                                            slice_sizes=(1, 1)\n                                                                                                            unique_indices=True ]" source_file="wave_equation.py" source_line=109}
  %pad.77 = f32[1032,1024]{1,0} pad(f32[1031,1024]{1,0} %pad.56, f32[] %gather.76), padding=0_1x0_0, metadata={op_type="pad" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/pad[ padding_config=((0, 1, 0), (0, 0, 0)) ]" source_file="wave_equation.py" source_line=109}
  %constant.78 = s32[] constant(1), metadata={op_type="lt" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/lt" source_file="wave_equation.py" source_line=109}
  %constant.79 = s32[] constant(0), metadata={op_type="lt" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/lt" source_file="wave_equation.py" source_line=109}
  %compare.80 = pred[] compare(s32[] %constant.78, s32[] %constant.79), direction=LT, metadata={op_type="lt" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/lt" source_file="wave_equation.py" source_line=109}
  %constant.81 = s32[] constant(1), metadata={op_type="add" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/add" source_file="wave_equation.py" source_line=109}
  %constant.82 = s32[] constant(2), metadata={op_type="add" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/add" source_file="wave_equation.py" source_line=109}
  %add.83 = s32[] add(s32[] %constant.81, s32[] %constant.82), metadata={op_type="add" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/add" source_file="wave_equation.py" source_line=109}
  %constant.84 = s32[] constant(1), metadata={op_type="select" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/select" source_file="wave_equation.py" source_line=109}
  %select.85 = s32[] select(pred[] %compare.80, s32[] %add.83, s32[] %constant.84), metadata={op_type="select" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/select" source_file="wave_equation.py" source_line=109}
  %broadcast.94 = s32[1]{0} broadcast(s32[] %select.85), dimensions={}, metadata={op_type="broadcast_in_dim" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/broadcast_in_dim[ broadcast_dimensions=(  )\n                                                                                                                      shape=(1,) ]" source_file="wave_equation.py" source_line=109}
  %constant.86 = s32[] constant(0), metadata={op_type="lt" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/lt" source_file="wave_equation.py" source_line=109}
  %constant.87 = s32[] constant(0), metadata={op_type="lt" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/lt" source_file="wave_equation.py" source_line=109}
  %compare.88 = pred[] compare(s32[] %constant.86, s32[] %constant.87), direction=LT, metadata={op_type="lt" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/lt" source_file="wave_equation.py" source_line=109}
  %constant.89 = s32[] constant(0), metadata={op_type="add" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/add" source_file="wave_equation.py" source_line=109}
  %constant.90 = s32[] constant(2), metadata={op_type="add" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/add" source_file="wave_equation.py" source_line=109}
  %add.91 = s32[] add(s32[] %constant.89, s32[] %constant.90), metadata={op_type="add" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/add" source_file="wave_equation.py" source_line=109}
  %constant.92 = s32[] constant(0), metadata={op_type="select" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/select" source_file="wave_equation.py" source_line=109}
  %select.93 = s32[] select(pred[] %compare.88, s32[] %add.91, s32[] %constant.92), metadata={op_type="select" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/select" source_file="wave_equation.py" source_line=109}
  %broadcast.95 = s32[1]{0} broadcast(s32[] %select.93), dimensions={}, metadata={op_type="broadcast_in_dim" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/broadcast_in_dim[ broadcast_dimensions=(  )\n                                                                                                                      shape=(1,) ]" source_file="wave_equation.py" source_line=109}
  %concatenate.96 = s32[2]{0} concatenate(s32[1]{0} %broadcast.94, s32[1]{0} %broadcast.95), dimensions={0}, metadata={op_type="concatenate" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/concatenate[ dimension=0 ]" source_file="wave_equation.py" source_line=109}
  %gather.97 = f32[] gather(f32[2,2]{1,0} %convert.35, s32[2]{0} %concatenate.96), offset_dims={}, collapsed_slice_dims={0,1}, start_index_map={0,1}, index_vector_dim=0, slice_sizes={1,1}, indices_are_sorted=true, metadata={op_type="gather" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/gather[ dimension_numbers=GatherDimensionNumbers(offset_dims=(), collapsed_slice_dims=(0, 1), start_index_map=(0, 1))\n                                                                                                            indices_are_sorted=True\n                                                                                                            slice_sizes=(1, 1)\n                                                                                                            unique_indices=True ]" source_file="wave_equation.py" source_line=109}
  %pad.98 = f32[1032,1024]{1,0} pad(f32[1032,1024]{1,0} %pad.77, f32[] %gather.97), padding=0_0x0_0, metadata={op_type="pad" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/pad[ padding_config=((0, 0, 0), (0, 0, 0)) ]" source_file="wave_equation.py" source_line=109}
  %constant.99 = s32[] constant(1), metadata={op_type="lt" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/lt" source_file="wave_equation.py" source_line=109}
  %constant.100 = s32[] constant(0), metadata={op_type="lt" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/lt" source_file="wave_equation.py" source_line=109}
  %compare.101 = pred[] compare(s32[] %constant.99, s32[] %constant.100), direction=LT, metadata={op_type="lt" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/lt" source_file="wave_equation.py" source_line=109}
  %constant.102 = s32[] constant(1), metadata={op_type="add" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/add" source_file="wave_equation.py" source_line=109}
  %constant.103 = s32[] constant(2), metadata={op_type="add" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/add" source_file="wave_equation.py" source_line=109}
  %add.104 = s32[] add(s32[] %constant.102, s32[] %constant.103), metadata={op_type="add" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/add" source_file="wave_equation.py" source_line=109}
  %constant.105 = s32[] constant(1), metadata={op_type="select" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/select" source_file="wave_equation.py" source_line=109}
  %select.106 = s32[] select(pred[] %compare.101, s32[] %add.104, s32[] %constant.105), metadata={op_type="select" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/select" source_file="wave_equation.py" source_line=109}
  %broadcast.115 = s32[1]{0} broadcast(s32[] %select.106), dimensions={}, metadata={op_type="broadcast_in_dim" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/broadcast_in_dim[ broadcast_dimensions=(  )\n                                                                                                                      shape=(1,) ]" source_file="wave_equation.py" source_line=109}
  %constant.107 = s32[] constant(1), metadata={op_type="lt" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/lt" source_file="wave_equation.py" source_line=109}
  %constant.108 = s32[] constant(0), metadata={op_type="lt" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/lt" source_file="wave_equation.py" source_line=109}
  %compare.109 = pred[] compare(s32[] %constant.107, s32[] %constant.108), direction=LT, metadata={op_type="lt" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/lt" source_file="wave_equation.py" source_line=109}
  %constant.110 = s32[] constant(1), metadata={op_type="add" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/add" source_file="wave_equation.py" source_line=109}
  %constant.111 = s32[] constant(2), metadata={op_type="add" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/add" source_file="wave_equation.py" source_line=109}
  %add.112 = s32[] add(s32[] %constant.110, s32[] %constant.111), metadata={op_type="add" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/add" source_file="wave_equation.py" source_line=109}
  %constant.113 = s32[] constant(1), metadata={op_type="select" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/select" source_file="wave_equation.py" source_line=109}
  %select.114 = s32[] select(pred[] %compare.109, s32[] %add.112, s32[] %constant.113), metadata={op_type="select" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/select" source_file="wave_equation.py" source_line=109}
  %broadcast.116 = s32[1]{0} broadcast(s32[] %select.114), dimensions={}, metadata={op_type="broadcast_in_dim" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/broadcast_in_dim[ broadcast_dimensions=(  )\n                                                                                                                      shape=(1,) ]" source_file="wave_equation.py" source_line=109}
  %concatenate.117 = s32[2]{0} concatenate(s32[1]{0} %broadcast.115, s32[1]{0} %broadcast.116), dimensions={0}, metadata={op_type="concatenate" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/concatenate[ dimension=0 ]" source_file="wave_equation.py" source_line=109}
  %gather.118 = f32[] gather(f32[2,2]{1,0} %convert.35, s32[2]{0} %concatenate.117), offset_dims={}, collapsed_slice_dims={0,1}, start_index_map={0,1}, index_vector_dim=0, slice_sizes={1,1}, indices_are_sorted=true, metadata={op_type="gather" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/gather[ dimension_numbers=GatherDimensionNumbers(offset_dims=(), collapsed_slice_dims=(0, 1), start_index_map=(0, 1))\n                                                                                                            indices_are_sorted=True\n                                                                                                            slice_sizes=(1, 1)\n                                                                                                            unique_indices=True ]" source_file="wave_equation.py" source_line=109}
  %pad.119 = f32[1032,1024]{1,0} pad(f32[1032,1024]{1,0} %pad.98, f32[] %gather.118), padding=0_0x0_0, metadata={op_type="pad" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/pad[ padding_config=((0, 0, 0), (0, 0, 0)) ]" source_file="wave_equation.py" source_line=109}
  ROOT %tuple.120 = (f32[1032,1024]{1,0}) tuple(f32[1032,1024]{1,0} %pad.119)
}

%jit__pad__5.121 (parameter.122: f32[1031,1024], parameter.123: s32[]) -> (f32[1032,1024]) {
  %constant.124 = pred[] constant(false)
  %parameter.122 = f32[1031,1024]{1,0} parameter(0)
  %parameter.123 = s32[] parameter(1)
  %broadcast.125 = s32[2,2]{1,0} broadcast(s32[] %parameter.123), dimensions={}, metadata={op_type="broadcast_in_dim" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/broadcast_in_dim[ broadcast_dimensions=(  )\n                                                                                                                      shape=(2, 2) ]" source_file="wave_equation.py" source_line=109}
  %convert.126 = f32[2,2]{1,0} convert(s32[2,2]{1,0} %broadcast.125), metadata={op_type="convert_element_type" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/convert_element_type[ new_dtype=float32\n                                                                                                                          weak_type=False ]" source_file="wave_equation.py" source_line=109}
  %constant.127 = s32[] constant(0), metadata={op_type="lt" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/lt" source_file="wave_equation.py" source_line=109}
  %constant.128 = s32[] constant(0), metadata={op_type="lt" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/lt" source_file="wave_equation.py" source_line=109}
  %compare.129 = pred[] compare(s32[] %constant.127, s32[] %constant.128), direction=LT, metadata={op_type="lt" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/lt" source_file="wave_equation.py" source_line=109}
  %constant.130 = s32[] constant(0), metadata={op_type="add" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/add" source_file="wave_equation.py" source_line=109}
  %constant.131 = s32[] constant(2), metadata={op_type="add" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/add" source_file="wave_equation.py" source_line=109}
  %add.132 = s32[] add(s32[] %constant.130, s32[] %constant.131), metadata={op_type="add" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/add" source_file="wave_equation.py" source_line=109}
  %constant.133 = s32[] constant(0), metadata={op_type="select" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/select" source_file="wave_equation.py" source_line=109}
  %select.134 = s32[] select(pred[] %compare.129, s32[] %add.132, s32[] %constant.133), metadata={op_type="select" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/select" source_file="wave_equation.py" source_line=109}
  %broadcast.143 = s32[1]{0} broadcast(s32[] %select.134), dimensions={}, metadata={op_type="broadcast_in_dim" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/broadcast_in_dim[ broadcast_dimensions=(  )\n                                                                                                                      shape=(1,) ]" source_file="wave_equation.py" source_line=109}
  %constant.135 = s32[] constant(0), metadata={op_type="lt" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/lt" source_file="wave_equation.py" source_line=109}
  %constant.136 = s32[] constant(0), metadata={op_type="lt" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/lt" source_file="wave_equation.py" source_line=109}
  %compare.137 = pred[] compare(s32[] %constant.135, s32[] %constant.136), direction=LT, metadata={op_type="lt" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/lt" source_file="wave_equation.py" source_line=109}
  %constant.138 = s32[] constant(0), metadata={op_type="add" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/add" source_file="wave_equation.py" source_line=109}
  %constant.139 = s32[] constant(2), metadata={op_type="add" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/add" source_file="wave_equation.py" source_line=109}
  %add.140 = s32[] add(s32[] %constant.138, s32[] %constant.139), metadata={op_type="add" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/add" source_file="wave_equation.py" source_line=109}
  %constant.141 = s32[] constant(0), metadata={op_type="select" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/select" source_file="wave_equation.py" source_line=109}
  %select.142 = s32[] select(pred[] %compare.137, s32[] %add.140, s32[] %constant.141), metadata={op_type="select" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/select" source_file="wave_equation.py" source_line=109}
  %broadcast.144 = s32[1]{0} broadcast(s32[] %select.142), dimensions={}, metadata={op_type="broadcast_in_dim" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/broadcast_in_dim[ broadcast_dimensions=(  )\n                                                                                                                      shape=(1,) ]" source_file="wave_equation.py" source_line=109}
  %concatenate.145 = s32[2]{0} concatenate(s32[1]{0} %broadcast.143, s32[1]{0} %broadcast.144), dimensions={0}, metadata={op_type="concatenate" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/concatenate[ dimension=0 ]" source_file="wave_equation.py" source_line=109}
  %gather.146 = f32[] gather(f32[2,2]{1,0} %convert.126, s32[2]{0} %concatenate.145), offset_dims={}, collapsed_slice_dims={0,1}, start_index_map={0,1}, index_vector_dim=0, slice_sizes={1,1}, indices_are_sorted=true, metadata={op_type="gather" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/gather[ dimension_numbers=GatherDimensionNumbers(offset_dims=(), collapsed_slice_dims=(0, 1), start_index_map=(0, 1))\n                                                                                                            indices_are_sorted=True\n                                                                                                            slice_sizes=(1, 1)\n                                                                                                            unique_indices=True ]" source_file="wave_equation.py" source_line=109}
  %pad.147 = f32[1032,1024]{1,0} pad(f32[1031,1024]{1,0} %parameter.122, f32[] %gather.146), padding=1_0x0_0, metadata={op_type="pad" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/pad[ padding_config=((1, 0, 0), (0, 0, 0)) ]" source_file="wave_equation.py" source_line=109}
  %constant.148 = s32[] constant(0), metadata={op_type="lt" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/lt" source_file="wave_equation.py" source_line=109}
  %constant.149 = s32[] constant(0), metadata={op_type="lt" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/lt" source_file="wave_equation.py" source_line=109}
  %compare.150 = pred[] compare(s32[] %constant.148, s32[] %constant.149), direction=LT, metadata={op_type="lt" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/lt" source_file="wave_equation.py" source_line=109}
  %constant.151 = s32[] constant(0), metadata={op_type="add" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/add" source_file="wave_equation.py" source_line=109}
  %constant.152 = s32[] constant(2), metadata={op_type="add" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/add" source_file="wave_equation.py" source_line=109}
  %add.153 = s32[] add(s32[] %constant.151, s32[] %constant.152), metadata={op_type="add" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/add" source_file="wave_equation.py" source_line=109}
  %constant.154 = s32[] constant(0), metadata={op_type="select" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/select" source_file="wave_equation.py" source_line=109}
  %select.155 = s32[] select(pred[] %compare.150, s32[] %add.153, s32[] %constant.154), metadata={op_type="select" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/select" source_file="wave_equation.py" source_line=109}
  %broadcast.164 = s32[1]{0} broadcast(s32[] %select.155), dimensions={}, metadata={op_type="broadcast_in_dim" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/broadcast_in_dim[ broadcast_dimensions=(  )\n                                                                                                                      shape=(1,) ]" source_file="wave_equation.py" source_line=109}
  %constant.156 = s32[] constant(1), metadata={op_type="lt" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/lt" source_file="wave_equation.py" source_line=109}
  %constant.157 = s32[] constant(0), metadata={op_type="lt" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/lt" source_file="wave_equation.py" source_line=109}
  %compare.158 = pred[] compare(s32[] %constant.156, s32[] %constant.157), direction=LT, metadata={op_type="lt" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/lt" source_file="wave_equation.py" source_line=109}
  %constant.159 = s32[] constant(1), metadata={op_type="add" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/add" source_file="wave_equation.py" source_line=109}
  %constant.160 = s32[] constant(2), metadata={op_type="add" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/add" source_file="wave_equation.py" source_line=109}
  %add.161 = s32[] add(s32[] %constant.159, s32[] %constant.160), metadata={op_type="add" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/add" source_file="wave_equation.py" source_line=109}
  %constant.162 = s32[] constant(1), metadata={op_type="select" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/select" source_file="wave_equation.py" source_line=109}
  %select.163 = s32[] select(pred[] %compare.158, s32[] %add.161, s32[] %constant.162), metadata={op_type="select" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/select" source_file="wave_equation.py" source_line=109}
  %broadcast.165 = s32[1]{0} broadcast(s32[] %select.163), dimensions={}, metadata={op_type="broadcast_in_dim" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/broadcast_in_dim[ broadcast_dimensions=(  )\n                                                                                                                      shape=(1,) ]" source_file="wave_equation.py" source_line=109}
  %concatenate.166 = s32[2]{0} concatenate(s32[1]{0} %broadcast.164, s32[1]{0} %broadcast.165), dimensions={0}, metadata={op_type="concatenate" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/concatenate[ dimension=0 ]" source_file="wave_equation.py" source_line=109}
  %gather.167 = f32[] gather(f32[2,2]{1,0} %convert.126, s32[2]{0} %concatenate.166), offset_dims={}, collapsed_slice_dims={0,1}, start_index_map={0,1}, index_vector_dim=0, slice_sizes={1,1}, indices_are_sorted=true, metadata={op_type="gather" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/gather[ dimension_numbers=GatherDimensionNumbers(offset_dims=(), collapsed_slice_dims=(0, 1), start_index_map=(0, 1))\n                                                                                                            indices_are_sorted=True\n                                                                                                            slice_sizes=(1, 1)\n                                                                                                            unique_indices=True ]" source_file="wave_equation.py" source_line=109}
  %pad.168 = f32[1032,1024]{1,0} pad(f32[1032,1024]{1,0} %pad.147, f32[] %gather.167), padding=0_0x0_0, metadata={op_type="pad" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/pad[ padding_config=((0, 0, 0), (0, 0, 0)) ]" source_file="wave_equation.py" source_line=109}
  %constant.169 = s32[] constant(1), metadata={op_type="lt" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/lt" source_file="wave_equation.py" source_line=109}
  %constant.170 = s32[] constant(0), metadata={op_type="lt" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/lt" source_file="wave_equation.py" source_line=109}
  %compare.171 = pred[] compare(s32[] %constant.169, s32[] %constant.170), direction=LT, metadata={op_type="lt" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/lt" source_file="wave_equation.py" source_line=109}
  %constant.172 = s32[] constant(1), metadata={op_type="add" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/add" source_file="wave_equation.py" source_line=109}
  %constant.173 = s32[] constant(2), metadata={op_type="add" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/add" source_file="wave_equation.py" source_line=109}
  %add.174 = s32[] add(s32[] %constant.172, s32[] %constant.173), metadata={op_type="add" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/add" source_file="wave_equation.py" source_line=109}
  %constant.175 = s32[] constant(1), metadata={op_type="select" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/select" source_file="wave_equation.py" source_line=109}
  %select.176 = s32[] select(pred[] %compare.171, s32[] %add.174, s32[] %constant.175), metadata={op_type="select" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/select" source_file="wave_equation.py" source_line=109}
  %broadcast.185 = s32[1]{0} broadcast(s32[] %select.176), dimensions={}, metadata={op_type="broadcast_in_dim" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/broadcast_in_dim[ broadcast_dimensions=(  )\n                                                                                                                      shape=(1,) ]" source_file="wave_equation.py" source_line=109}
  %constant.177 = s32[] constant(0), metadata={op_type="lt" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/lt" source_file="wave_equation.py" source_line=109}
  %constant.178 = s32[] constant(0), metadata={op_type="lt" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/lt" source_file="wave_equation.py" source_line=109}
  %compare.179 = pred[] compare(s32[] %constant.177, s32[] %constant.178), direction=LT, metadata={op_type="lt" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/lt" source_file="wave_equation.py" source_line=109}
  %constant.180 = s32[] constant(0), metadata={op_type="add" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/add" source_file="wave_equation.py" source_line=109}
  %constant.181 = s32[] constant(2), metadata={op_type="add" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/add" source_file="wave_equation.py" source_line=109}
  %add.182 = s32[] add(s32[] %constant.180, s32[] %constant.181), metadata={op_type="add" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/add" source_file="wave_equation.py" source_line=109}
  %constant.183 = s32[] constant(0), metadata={op_type="select" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/select" source_file="wave_equation.py" source_line=109}
  %select.184 = s32[] select(pred[] %compare.179, s32[] %add.182, s32[] %constant.183), metadata={op_type="select" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/select" source_file="wave_equation.py" source_line=109}
  %broadcast.186 = s32[1]{0} broadcast(s32[] %select.184), dimensions={}, metadata={op_type="broadcast_in_dim" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/broadcast_in_dim[ broadcast_dimensions=(  )\n                                                                                                                      shape=(1,) ]" source_file="wave_equation.py" source_line=109}
  %concatenate.187 = s32[2]{0} concatenate(s32[1]{0} %broadcast.185, s32[1]{0} %broadcast.186), dimensions={0}, metadata={op_type="concatenate" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/concatenate[ dimension=0 ]" source_file="wave_equation.py" source_line=109}
  %gather.188 = f32[] gather(f32[2,2]{1,0} %convert.126, s32[2]{0} %concatenate.187), offset_dims={}, collapsed_slice_dims={0,1}, start_index_map={0,1}, index_vector_dim=0, slice_sizes={1,1}, indices_are_sorted=true, metadata={op_type="gather" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/gather[ dimension_numbers=GatherDimensionNumbers(offset_dims=(), collapsed_slice_dims=(0, 1), start_index_map=(0, 1))\n                                                                                                            indices_are_sorted=True\n                                                                                                            slice_sizes=(1, 1)\n                                                                                                            unique_indices=True ]" source_file="wave_equation.py" source_line=109}
  %pad.189 = f32[1032,1024]{1,0} pad(f32[1032,1024]{1,0} %pad.168, f32[] %gather.188), padding=0_0x0_0, metadata={op_type="pad" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/pad[ padding_config=((0, 0, 0), (0, 0, 0)) ]" source_file="wave_equation.py" source_line=109}
  %constant.190 = s32[] constant(1), metadata={op_type="lt" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/lt" source_file="wave_equation.py" source_line=109}
  %constant.191 = s32[] constant(0), metadata={op_type="lt" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/lt" source_file="wave_equation.py" source_line=109}
  %compare.192 = pred[] compare(s32[] %constant.190, s32[] %constant.191), direction=LT, metadata={op_type="lt" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/lt" source_file="wave_equation.py" source_line=109}
  %constant.193 = s32[] constant(1), metadata={op_type="add" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/add" source_file="wave_equation.py" source_line=109}
  %constant.194 = s32[] constant(2), metadata={op_type="add" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/add" source_file="wave_equation.py" source_line=109}
  %add.195 = s32[] add(s32[] %constant.193, s32[] %constant.194), metadata={op_type="add" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/add" source_file="wave_equation.py" source_line=109}
  %constant.196 = s32[] constant(1), metadata={op_type="select" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/select" source_file="wave_equation.py" source_line=109}
  %select.197 = s32[] select(pred[] %compare.192, s32[] %add.195, s32[] %constant.196), metadata={op_type="select" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/select" source_file="wave_equation.py" source_line=109}
  %broadcast.206 = s32[1]{0} broadcast(s32[] %select.197), dimensions={}, metadata={op_type="broadcast_in_dim" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/broadcast_in_dim[ broadcast_dimensions=(  )\n                                                                                                                      shape=(1,) ]" source_file="wave_equation.py" source_line=109}
  %constant.198 = s32[] constant(1), metadata={op_type="lt" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/lt" source_file="wave_equation.py" source_line=109}
  %constant.199 = s32[] constant(0), metadata={op_type="lt" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/lt" source_file="wave_equation.py" source_line=109}
  %compare.200 = pred[] compare(s32[] %constant.198, s32[] %constant.199), direction=LT, metadata={op_type="lt" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/lt" source_file="wave_equation.py" source_line=109}
  %constant.201 = s32[] constant(1), metadata={op_type="add" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/add" source_file="wave_equation.py" source_line=109}
  %constant.202 = s32[] constant(2), metadata={op_type="add" op_name="pmap(simulate_until_output)/scan/while/body/jit(multi_step)/while/body/jit(leapfrog_step)/jit(_pad)/add" source_file="wave_equation.py" source_line=109}
