HloModule pmap_eval_step.3589

%primitive_computation_add__2.3550 (parameter.3551: f32[], parameter.3552: f32[]) -> f32[] {
  %parameter.3551 = f32[] parameter(0), metadata={op_type="add" op_name="add"}
  %parameter.3552 = f32[] parameter(1), metadata={op_type="add" op_name="add"}
  ROOT %add.3553 = f32[] add(f32[] %parameter.3551, f32[] %parameter.3552), metadata={op_type="add" op_name="add"}
}

%primitive_computation_add__2.3557 (parameter.3558: f32[], parameter.3559: f32[]) -> f32[] {
  %parameter.3558 = f32[] parameter(0), metadata={op_type="add" op_name="add"}
  %parameter.3559 = f32[] parameter(1), metadata={op_type="add" op_name="add"}
  ROOT %add.3560 = f32[] add(f32[] %parameter.3558, f32[] %parameter.3559), metadata={op_type="add" op_name="add"}
}

%primitive_computation_add__2.3564 (parameter.3565: f32[], parameter.3566: f32[]) -> f32[] {
  %parameter.3565 = f32[] parameter(0), metadata={op_type="add" op_name="add"}
  %parameter.3566 = f32[] parameter(1), metadata={op_type="add" op_name="add"}
  ROOT %add.3567 = f32[] add(f32[] %parameter.3565, f32[] %parameter.3566), metadata={op_type="add" op_name="add"}
}

%fused_computation.1 (param_0.528: f32[64,128], param_1.555: s32[64,128], param_2.778: s32[64,128]) -> (f32[], f32[], f32[]) {
  %param_0.528 = f32[64,128]{1,0} parameter(0)
  %negate.0 = f32[64,128]{1,0} negate(f32[64,128]{1,0} %param_0.528), metadata={op_type="neg" op_name="pmap(eval_step)/neg" source_file="/usr/local/lib/python3.8/dist-packages/optax/_src/loss.py" source_line=164}
  %param_1.555 = s32[64,128]{1,0} parameter(1)
  %constant_588 = s32[] constant(0), metadata={op_type="lt" op_name="pmap(eval_step)/lt" source_file="/usr/local/lib/python3.8/dist-packages/flax/linen/linear.py" source_line=411}
  %broadcast.1314 = s32[64,128]{1,0} broadcast(s32[] %constant_588), dimensions={}, metadata={op_type="lt" op_name="pmap(eval_step)/lt" source_file="/usr/local/lib/python3.8/dist-packages/flax/linen/linear.py" source_line=411}
  %compare.27 = pred[64,128]{1,0} compare(s32[64,128]{1,0} %param_1.555, s32[64,128]{1,0} %broadcast.1314), direction=GT, metadata={op_type="gt" op_name="pmap(eval_step)/gt" source_file="roberta.py" source_line=183}
  %constant_587 = f32[] constant(1), metadata={op_type="add" op_name="pmap(eval_step)/add" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=313}
  %broadcast.1313 = f32[64,128]{1,0} broadcast(f32[] %constant_587), dimensions={}, metadata={op_type="broadcast_in_dim" op_name="pmap(eval_step)/jit(_where)/broadcast_in_dim[ broadcast_dimensions=(  )\n                                              shape=(64, 128) ]" source_file="roberta.py" source_line=183}
  %constant_170 = f32[] constant(0), metadata={op_type="reduce_sum" op_name="pmap(eval_step)/reduce_sum[ axes=(2,) ]" source_file="/usr/local/lib/python3.8/dist-packages/flax/linen/normalization.py" source_line=185}
  %broadcast.1311 = f32[64,128]{1,0} broadcast(f32[] %constant_170), dimensions={}, metadata={op_type="broadcast_in_dim" op_name="pmap(eval_step)/broadcast_in_dim[ broadcast_dimensions=(  )\n                                  shape=(64, 1, 1, 128) ]" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=221}
  %select.30 = f32[64,128]{1,0} select(pred[64,128]{1,0} %compare.27, f32[64,128]{1,0} %broadcast.1313, f32[64,128]{1,0} %broadcast.1311), metadata={op_type="select" op_name="pmap(eval_step)/jit(_where)/select" source_file="roberta.py" source_line=183}
  %multiply.168 = f32[64,128]{1,0} multiply(f32[64,128]{1,0} %negate.0, f32[64,128]{1,0} %select.30), metadata={op_type="mul" op_name="pmap(eval_step)/mul" source_file="roberta.py" source_line=184}
  %bitcast.130 = f32[8192]{0} bitcast(f32[64,128]{1,0} %multiply.168)
  %reduce.4 = f32[] reduce(f32[8192]{0} %bitcast.130, f32[] %constant_170), dimensions={0}, to_apply=%primitive_computation_add__2.3550, metadata={op_type="reduce_sum" op_name="pmap(eval_step)/reduce_sum[ axes=(0, 1) ]" source_file="roberta.py" source_line=190}
  %param_2.778 = s32[64,128]{1,0} parameter(2)
  %compare.15.clone.1 = pred[64,128]{1,0} compare(s32[64,128]{1,0} %param_2.778, s32[64,128]{1,0} %param_1.555), direction=EQ, metadata={op_type="eq" op_name="pmap(eval_step)/eq" source_file="roberta.py" source_line=187}
  %select.20.clone.1 = f32[64,128]{1,0} select(pred[64,128]{1,0} %compare.15.clone.1, f32[64,128]{1,0} %select.30, f32[64,128]{1,0} %broadcast.1311), metadata={op_type="mul" op_name="pmap(eval_step)/mul" source_file="roberta.py" source_line=187}
  %bitcast.131.clone.1 = f32[8192]{0} bitcast(f32[64,128]{1,0} %select.20.clone.1)
  %reduce.7.clone.1 = f32[] reduce(f32[8192]{0} %bitcast.131.clone.1, f32[] %constant_170), dimensions={0}, to_apply=%primitive_computation_add__2.3557, metadata={op_type="reduce_sum" op_name="pmap(eval_step)/reduce_sum[ axes=(0, 1) ]" source_file="roberta.py" source_line=190}
  %bitcast.129.clone.1 = f32[8192]{0} bitcast(f32[64,128]{1,0} %select.30)
  %reduce.3.clone.1 = f32[] reduce(f32[8192]{0} %bitcast.129.clone.1, f32[] %constant_170), dimensions={0}, to_apply=%primitive_computation_add__2.3564, metadata={op_type="reduce_sum" op_name="pmap(eval_step)/reduce_sum[ axes=(0, 1) ]" source_file="roberta.py" source_line=190}
  ROOT %tuple.30 = (f32[], f32[], f32[]) tuple(f32[] %reduce.4, f32[] %reduce.7.clone.1, f32[] %reduce.3.clone.1)
}

%primitive_computation_add__2.3515 (parameter.3516: f32[], parameter.3517: f32[]) -> f32[] {
  %parameter.3516 = f32[] parameter(0), metadata={op_type="add" op_name="add"}
  %parameter.3517 = f32[] parameter(1), metadata={op_type="add" op_name="add"}
  ROOT %add.3518 = f32[] add(f32[] %parameter.3516, f32[] %parameter.3517), metadata={op_type="add" op_name="add"}
}

%fused_computation.2 (param_0.459: f32[64,128], param_1.493: s32[64,128], param_2.774: f32[64,128], param_3.730: f32[50265], param_4.633: f32[8192,50265]) -> f32[64,128] {
  %param_1.493 = s32[64,128]{1,0} parameter(1)
  %broadcast.598 = s32[64,128,50265]{2,1,0} broadcast(s32[64,128]{1,0} %param_1.493), dimensions={0,1}, metadata={op_type="eq" op_name="pmap(eval_step)/eq" source_file="/usr/local/lib/python3.8/dist-packages/flax/training/common_utils.py" source_line=38}
  %iota.3 = s32[64,128,50265]{2,1,0} iota(), iota_dimension=2, metadata={op_type="eq" op_name="pmap(eval_step)/eq" source_file="/usr/local/lib/python3.8/dist-packages/flax/training/common_utils.py" source_line=38}
  %compare.14 = pred[64,128,50265]{2,1,0} compare(s32[64,128,50265]{2,1,0} %broadcast.598, s32[64,128,50265]{2,1,0} %iota.3), direction=EQ, metadata={op_type="eq" op_name="pmap(eval_step)/eq" source_file="/usr/local/lib/python3.8/dist-packages/flax/training/common_utils.py" source_line=38}
  %constant_171 = f32[] constant(1), metadata={op_type="add" op_name="pmap(eval_step)/add" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=313}
  %broadcast.597 = f32[64,128,50265]{2,1,0} broadcast(f32[] %constant_171), dimensions={}, metadata={op_type="broadcast_in_dim" op_name="pmap(eval_step)/broadcast_in_dim[ broadcast_dimensions=(  )\n                                  shape=(64, 128, 50265) ]" source_file="/usr/local/lib/python3.8/dist-packages/flax/training/common_utils.py" source_line=39}
  %constant_172 = f32[] constant(0), metadata={op_type="reduce_sum" op_name="pmap(eval_step)/reduce_sum[ axes=(2,) ]" source_file="/usr/local/lib/python3.8/dist-packages/flax/linen/normalization.py" source_line=185}
  %broadcast.595 = f32[64,128,50265]{2,1,0} broadcast(f32[] %constant_172), dimensions={}, metadata={op_type="broadcast_in_dim" op_name="pmap(eval_step)/broadcast_in_dim[ broadcast_dimensions=(  )\n                                  shape=(64, 128, 50265) ]" source_file="/usr/local/lib/python3.8/dist-packages/flax/training/common_utils.py" source_line=39}
  %select.19 = f32[64,128,50265]{2,1,0} select(pred[64,128,50265]{2,1,0} %compare.14, f32[64,128,50265]{2,1,0} %broadcast.597, f32[64,128,50265]{2,1,0} %broadcast.595), metadata={op_type="select" op_name="pmap(eval_step)/select" source_file="/usr/local/lib/python3.8/dist-packages/flax/training/common_utils.py" source_line=39}
  %param_4.633 = f32[8192,50265]{1,0} parameter(4)
  %bitcast.391 = f32[64,128,50265]{2,1,0} bitcast(f32[8192,50265]{1,0} %param_4.633), metadata={op_type="dot_general" op_name="pmap(eval_step)/dot_general[ dimension_numbers=(((2,), (0,)), ((), ()))\n                             precision=None\n                             preferred_element_type=None ]" source_file="/usr/local/lib/python3.8/dist-packages/flax/linen/linear.py" source_line=175}
  %param_3.730 = f32[50265]{0} parameter(3)
  %broadcast.1815 = f32[64,128,50265]{2,1,0} broadcast(f32[50265]{0} %param_3.730), dimensions={2}, metadata={op_type="add" op_name="pmap(eval_step)/add" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=487}
  %add.916 = f32[64,128,50265]{2,1,0} add(f32[64,128,50265]{2,1,0} %bitcast.391, f32[64,128,50265]{2,1,0} %broadcast.1815), metadata={op_type="add" op_name="pmap(eval_step)/add" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=487}
  %param_2.774 = f32[64,128]{1,0} parameter(2)
  %broadcast.909 = f32[64,128,50265]{2,1,0} broadcast(f32[64,128]{1,0} %param_2.774), dimensions={0,1}, metadata={op_type="eq" op_name="eq" source_file="roberta.py" source_line=233}
  %subtract.92 = f32[64,128,50265]{2,1,0} subtract(f32[64,128,50265]{2,1,0} %add.916, f32[64,128,50265]{2,1,0} %broadcast.909), metadata={op_type="sub" op_name="pmap(eval_step)/sub" source_file="/usr/local/lib/python3.8/dist-packages/optax/_src/loss.py" source_line=164}
  %param_0.459 = f32[64,128]{1,0} parameter(0)
  %broadcast.594 = f32[64,128,50265]{2,1,0} broadcast(f32[64,128]{1,0} %param_0.459), dimensions={0,1}, metadata={op_type="sub" op_name="pmap(eval_step)/sub" source_file="/usr/local/lib/python3.8/dist-packages/optax/_src/loss.py" source_line=164}
  %subtract.27 = f32[64,128,50265]{2,1,0} subtract(f32[64,128,50265]{2,1,0} %subtract.92, f32[64,128,50265]{2,1,0} %broadcast.594), metadata={op_type="sub" op_name="pmap(eval_step)/sub" source_file="/usr/local/lib/python3.8/dist-packages/optax/_src/loss.py" source_line=164}
  %multiply.169 = f32[64,128,50265]{2,1,0} multiply(f32[64,128,50265]{2,1,0} %select.19, f32[64,128,50265]{2,1,0} %subtract.27), metadata={op_type="mul" op_name="pmap(eval_step)/mul" source_file="/usr/local/lib/python3.8/dist-packages/optax/_src/loss.py" source_line=164}
  ROOT %reduce.5 = f32[64,128]{1,0} reduce(f32[64,128,50265]{2,1,0} %multiply.169, f32[] %constant_172), dimensions={2}, to_apply=%primitive_computation_add__2.3515, metadata={op_type="reduce_sum" op_name="pmap(eval_step)/reduce_sum[ axes=(2,) ]" source_file="/usr/local/lib/python3.8/dist-packages/optax/_src/loss.py" source_line=164}
}

%primitive_computation_add__2.3503 (parameter.3504: f32[], parameter.3505: f32[]) -> f32[] {
  %parameter.3504 = f32[] parameter(0), metadata={op_type="add" op_name="add"}
  %parameter.3505 = f32[] parameter(1), metadata={op_type="add" op_name="add"}
  ROOT %add.3506 = f32[] add(f32[] %parameter.3504, f32[] %parameter.3505), metadata={op_type="add" op_name="add"}
}

%fused_computation.3 (param_0.762: f32[64,128], param_1.884: f32[50265], param_2.770: f32[8192,50265]) -> f32[64,128] {
  %param_2.770 = f32[8192,50265]{1,0} parameter(2)
  %bitcast.387 = f32[64,128,50265]{2,1,0} bitcast(f32[8192,50265]{1,0} %param_2.770), metadata={op_type="dot_general" op_name="pmap(eval_step)/dot_general[ dimension_numbers=(((2,), (0,)), ((), ()))\n                             precision=None\n                             preferred_element_type=None ]" source_file="/usr/local/lib/python3.8/dist-packages/flax/linen/linear.py" source_line=175}
  %param_1.884 = f32[50265]{0} parameter(1)
  %broadcast.1810 = f32[64,128,50265]{2,1,0} broadcast(f32[50265]{0} %param_1.884), dimensions={2}, metadata={op_type="add" op_name="pmap(eval_step)/add" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=487}
  %add.911 = f32[64,128,50265]{2,1,0} add(f32[64,128,50265]{2,1,0} %bitcast.387, f32[64,128,50265]{2,1,0} %broadcast.1810), metadata={op_type="add" op_name="pmap(eval_step)/add" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=487}
  %param_0.762 = f32[64,128]{1,0} parameter(0)
  %broadcast.910 = f32[64,128,50265]{2,1,0} broadcast(f32[64,128]{1,0} %param_0.762), dimensions={0,1}, metadata={op_type="eq" op_name="eq" source_file="roberta.py" source_line=233}
  %subtract.93 = f32[64,128,50265]{2,1,0} subtract(f32[64,128,50265]{2,1,0} %add.911, f32[64,128,50265]{2,1,0} %broadcast.910), metadata={op_type="sub" op_name="pmap(eval_step)/sub" source_file="/usr/local/lib/python3.8/dist-packages/optax/_src/loss.py" source_line=164}
  %exponential.0 = f32[64,128,50265]{2,1,0} exponential(f32[64,128,50265]{2,1,0} %subtract.93), metadata={op_type="exp" op_name="pmap(eval_step)/exp" source_file="/usr/local/lib/python3.8/dist-packages/optax/_src/loss.py" source_line=164}
  %constant_173 = f32[] constant(0), metadata={op_type="reduce_sum" op_name="pmap(eval_step)/reduce_sum[ axes=(2,) ]" source_file="/usr/local/lib/python3.8/dist-packages/flax/linen/normalization.py" source_line=185}
  ROOT %reduce.6 = f32[64,128]{1,0} reduce(f32[64,128,50265]{2,1,0} %exponential.0, f32[] %constant_173), dimensions={2}, to_apply=%primitive_computation_add__2.3503, metadata={op_type="reduce_sum" op_name="pmap(eval_step)/reduce_sum[ axes=(2,) ]" source_file="/usr/local/lib/python3.8/dist-packages/optax/_src/loss.py" source_line=164}
}

%primitive_computation_min.3541 (parameter.3542: s32[], parameter.3543: s32[]) -> s32[] {
  %parameter.3542 = s32[] parameter(0), metadata={op_type="min" op_name="min"}
  %parameter.3543 = s32[] parameter(1), metadata={op_type="min" op_name="min"}
  ROOT %minimum.3544 = s32[] minimum(s32[] %parameter.3542, s32[] %parameter.3543), metadata={op_type="min" op_name="min"}
}

%fused_computation.6 (param_0.760: f32[64,128], param_1.881: f32[50265], param_2.767: f32[8192,50265]) -> s32[64,128] {
  %param_2.767 = f32[8192,50265]{1,0} parameter(2)
  %bitcast.385 = f32[64,128,50265]{2,1,0} bitcast(f32[8192,50265]{1,0} %param_2.767), metadata={op_type="dot_general" op_name="pmap(eval_step)/dot_general[ dimension_numbers=(((2,), (0,)), ((), ()))\n                             precision=None\n                             preferred_element_type=None ]" source_file="/usr/local/lib/python3.8/dist-packages/flax/linen/linear.py" source_line=175}
  %param_1.881 = f32[50265]{0} parameter(1)
  %broadcast.1807 = f32[64,128,50265]{2,1,0} broadcast(f32[50265]{0} %param_1.881), dimensions={2}, metadata={op_type="add" op_name="pmap(eval_step)/add" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=487}
  %add.909 = f32[64,128,50265]{2,1,0} add(f32[64,128,50265]{2,1,0} %bitcast.385, f32[64,128,50265]{2,1,0} %broadcast.1807), metadata={op_type="add" op_name="pmap(eval_step)/add" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=487}
  %param_0.760 = f32[64,128]{1,0} parameter(0)
  %broadcast.914 = f32[64,128,50265]{2,1,0} broadcast(f32[64,128]{1,0} %param_0.760), dimensions={0,1}, metadata={op_type="eq" op_name="eq" source_file="roberta.py" source_line=233}
  %compare.18 = pred[64,128,50265]{2,1,0} compare(f32[64,128,50265]{2,1,0} %add.909, f32[64,128,50265]{2,1,0} %broadcast.914), direction=EQ, metadata={op_type="eq" op_name="eq" source_file="roberta.py" source_line=233}
  %compare.17 = pred[64,128,50265]{2,1,0} compare(f32[64,128,50265]{2,1,0} %add.909, f32[64,128,50265]{2,1,0} %add.909), direction=NE, metadata={op_type="ne" op_name="ne" source_file="roberta.py" source_line=233}
  %or.0 = pred[64,128,50265]{2,1,0} or(pred[64,128,50265]{2,1,0} %compare.18, pred[64,128,50265]{2,1,0} %compare.17), metadata={op_type="or" op_name="or" source_file="roberta.py" source_line=233}
  %iota.4 = s32[64,128,50265]{2,1,0} iota(), iota_dimension=2, metadata={op_type="iota" op_name="iota[ dimension=2\n      dtype=int32\n      shape=(64, 128, 50265) ]" source_file="roberta.py" source_line=233}
  %constant_164 = s32[] constant(2147483647), metadata={op_type="broadcast_in_dim" op_name="broadcast_in_dim[ broadcast_dimensions=(  )\n                  shape=(64, 128, 50265) ]" source_file="roberta.py" source_line=233}
  %broadcast.600 = s32[64,128,50265]{2,1,0} broadcast(s32[] %constant_164), dimensions={}, metadata={op_type="broadcast_in_dim" op_name="broadcast_in_dim[ broadcast_dimensions=(  )\n                  shape=(64, 128, 50265) ]" source_file="roberta.py" source_line=233}
  %select.22 = s32[64,128,50265]{2,1,0} select(pred[64,128,50265]{2,1,0} %or.0, s32[64,128,50265]{2,1,0} %iota.4, s32[64,128,50265]{2,1,0} %broadcast.600), metadata={op_type="select" op_name="select" source_file="roberta.py" source_line=233}
  ROOT %reduce.8 = s32[64,128]{1,0} reduce(s32[64,128,50265]{2,1,0} %select.22, s32[] %constant_164), dimensions={2}, to_apply=%primitive_computation_min.3541, metadata={op_type="reduce_min" op_name="reduce_min[ axes=(2,) ]" source_file="roberta.py" source_line=233}
}

%fused_computation.8 (param_0.21: f32[768], param_1.30: f32[768], param_2.319: f32[64,128], param_3.728: f32[64,128], param_4.630: f32[768], param_5.638: f32[8192,768]) -> f32[8192,768] {
  %param_5.638 = f32[8192,768]{1,0} parameter(5)
  %bitcast.383 = f32[64,128,768]{2,1,0} bitcast(f32[8192,768]{1,0} %param_5.638), metadata={op_type="dot_general" op_name="pmap(eval_step)/dot_general[ dimension_numbers=(((2,), (0,)), ((), ()))\n                             precision=None\n                             preferred_element_type=None ]" source_file="/usr/local/lib/python3.8/dist-packages/flax/linen/linear.py" source_line=175}
  %param_4.630 = f32[768]{0} parameter(4)
  %broadcast.1805 = f32[64,128,768]{2,1,0} broadcast(f32[768]{0} %param_4.630), dimensions={2}, metadata={op_type="add" op_name="pmap(eval_step)/add" source_file="/usr/local/lib/python3.8/dist-packages/flax/linen/linear.py" source_line=181}
  %add.906 = f32[64,128,768]{2,1,0} add(f32[64,128,768]{2,1,0} %bitcast.383, f32[64,128,768]{2,1,0} %broadcast.1805), metadata={op_type="add" op_name="pmap(eval_step)/add" source_file="/usr/local/lib/python3.8/dist-packages/flax/linen/linear.py" source_line=181}
  %constant_935 = f32[] constant(-4), metadata={op_type="erf" op_name="pmap(eval_step)/erf" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=313}
  %broadcast.1803 = f32[64,128,768]{2,1,0} broadcast(f32[] %constant_935), dimensions={}, metadata={op_type="erf" op_name="pmap(eval_step)/erf" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=479}
  %constant_933 = f32[] constant(0.707106769)
  %broadcast.1802 = f32[64,128,768]{2,1,0} broadcast(f32[] %constant_933), dimensions={}
  %multiply.669 = f32[64,128,768]{2,1,0} multiply(f32[64,128,768]{2,1,0} %add.906, f32[64,128,768]{2,1,0} %broadcast.1802), metadata={op_type="div" op_name="pmap(eval_step)/div" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=479}
  %constant_932 = f32[] constant(4), metadata={op_type="erf" op_name="pmap(eval_step)/erf" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=313}
  %broadcast.1801 = f32[64,128,768]{2,1,0} broadcast(f32[] %constant_932), dimensions={}, metadata={op_type="erf" op_name="pmap(eval_step)/erf" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=479}
  %clamp.18 = f32[64,128,768]{2,1,0} clamp(f32[64,128,768]{2,1,0} %broadcast.1803, f32[64,128,768]{2,1,0} %multiply.669, f32[64,128,768]{2,1,0} %broadcast.1801), metadata={op_type="erf" op_name="pmap(eval_step)/erf" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=479}
  %constant_931 = f32[] constant(0), metadata={op_type="reduce_sum" op_name="pmap(eval_step)/reduce_sum[ axes=(2,) ]" source_file="/usr/local/lib/python3.8/dist-packages/flax/linen/normalization.py" source_line=185}
  %broadcast.1799 = f32[64,128,768]{2,1,0} broadcast(f32[] %constant_931), dimensions={}, metadata={op_type="erf" op_name="pmap(eval_step)/erf" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=479}
  %multiply.668 = f32[64,128,768]{2,1,0} multiply(f32[64,128,768]{2,1,0} %clamp.18, f32[64,128,768]{2,1,0} %clamp.18), metadata={op_type="erf" op_name="pmap(eval_step)/erf" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=479}
  %multiply.667 = f32[64,128,768]{2,1,0} multiply(f32[64,128,768]{2,1,0} %broadcast.1799, f32[64,128,768]{2,1,0} %multiply.668), metadata={op_type="erf" op_name="pmap(eval_step)/erf" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=479}
  %constant_930 = f32[] constant(-2.72614237e-10), metadata={op_type="erf" op_name="pmap(eval_step)/erf" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=313}
  %broadcast.1798 = f32[64,128,768]{2,1,0} broadcast(f32[] %constant_930), dimensions={}, metadata={op_type="erf" op_name="pmap(eval_step)/erf" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=479}
  %add.905 = f32[64,128,768]{2,1,0} add(f32[64,128,768]{2,1,0} %multiply.667, f32[64,128,768]{2,1,0} %broadcast.1798), metadata={op_type="erf" op_name="pmap(eval_step)/erf" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=479}
  %multiply.666 = f32[64,128,768]{2,1,0} multiply(f32[64,128,768]{2,1,0} %add.905, f32[64,128,768]{2,1,0} %multiply.668), metadata={op_type="erf" op_name="pmap(eval_step)/erf" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=479}
  %constant_929 = f32[] constant(2.77068146e-08), metadata={op_type="erf" op_name="pmap(eval_step)/erf" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=313}
  %broadcast.1797 = f32[64,128,768]{2,1,0} broadcast(f32[] %constant_929), dimensions={}, metadata={op_type="erf" op_name="pmap(eval_step)/erf" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=479}
  %add.904 = f32[64,128,768]{2,1,0} add(f32[64,128,768]{2,1,0} %multiply.666, f32[64,128,768]{2,1,0} %broadcast.1797), metadata={op_type="erf" op_name="pmap(eval_step)/erf" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=479}
  %multiply.665 = f32[64,128,768]{2,1,0} multiply(f32[64,128,768]{2,1,0} %add.904, f32[64,128,768]{2,1,0} %multiply.668), metadata={op_type="erf" op_name="pmap(eval_step)/erf" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=479}
  %constant_928 = f32[] constant(-2.10102394e-06), metadata={op_type="erf" op_name="pmap(eval_step)/erf" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=313}
  %broadcast.1795 = f32[64,128,768]{2,1,0} broadcast(f32[] %constant_928), dimensions={}, metadata={op_type="erf" op_name="pmap(eval_step)/erf" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=479}
  %add.903 = f32[64,128,768]{2,1,0} add(f32[64,128,768]{2,1,0} %multiply.665, f32[64,128,768]{2,1,0} %broadcast.1795), metadata={op_type="erf" op_name="pmap(eval_step)/erf" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=479}
  %multiply.664 = f32[64,128,768]{2,1,0} multiply(f32[64,128,768]{2,1,0} %add.903, f32[64,128,768]{2,1,0} %multiply.668), metadata={op_type="erf" op_name="pmap(eval_step)/erf" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=479}
  %constant_926 = f32[] constant(-5.69250624e-05), metadata={op_type="erf" op_name="pmap(eval_step)/erf" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=313}
  %broadcast.1794 = f32[64,128,768]{2,1,0} broadcast(f32[] %constant_926), dimensions={}, metadata={op_type="erf" op_name="pmap(eval_step)/erf" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=479}
  %add.901 = f32[64,128,768]{2,1,0} add(f32[64,128,768]{2,1,0} %multiply.664, f32[64,128,768]{2,1,0} %broadcast.1794), metadata={op_type="erf" op_name="pmap(eval_step)/erf" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=479}
  %multiply.663 = f32[64,128,768]{2,1,0} multiply(f32[64,128,768]{2,1,0} %add.901, f32[64,128,768]{2,1,0} %multiply.668), metadata={op_type="erf" op_name="pmap(eval_step)/erf" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=479}
  %constant_925 = f32[] constant(-0.000734990637), metadata={op_type="erf" op_name="pmap(eval_step)/erf" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=313}
  %broadcast.1793 = f32[64,128,768]{2,1,0} broadcast(f32[] %constant_925), dimensions={}, metadata={op_type="erf" op_name="pmap(eval_step)/erf" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=479}
  %add.900 = f32[64,128,768]{2,1,0} add(f32[64,128,768]{2,1,0} %multiply.663, f32[64,128,768]{2,1,0} %broadcast.1793), metadata={op_type="erf" op_name="pmap(eval_step)/erf" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=479}
  %multiply.662 = f32[64,128,768]{2,1,0} multiply(f32[64,128,768]{2,1,0} %add.900, f32[64,128,768]{2,1,0} %multiply.668), metadata={op_type="erf" op_name="pmap(eval_step)/erf" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=479}
  %constant_924 = f32[] constant(-0.0029546), metadata={op_type="erf" op_name="pmap(eval_step)/erf" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=313}
  %broadcast.1791 = f32[64,128,768]{2,1,0} broadcast(f32[] %constant_924), dimensions={}, metadata={op_type="erf" op_name="pmap(eval_step)/erf" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=479}
  %add.899 = f32[64,128,768]{2,1,0} add(f32[64,128,768]{2,1,0} %multiply.662, f32[64,128,768]{2,1,0} %broadcast.1791), metadata={op_type="erf" op_name="pmap(eval_step)/erf" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=479}
  %multiply.661 = f32[64,128,768]{2,1,0} multiply(f32[64,128,768]{2,1,0} %add.899, f32[64,128,768]{2,1,0} %multiply.668), metadata={op_type="erf" op_name="pmap(eval_step)/erf" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=479}
  %constant_922 = f32[] constant(-0.0160960332), metadata={op_type="erf" op_name="pmap(eval_step)/erf" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=313}
  %broadcast.1789 = f32[64,128,768]{2,1,0} broadcast(f32[] %constant_922), dimensions={}, metadata={op_type="erf" op_name="pmap(eval_step)/erf" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=479}
  %add.898 = f32[64,128,768]{2,1,0} add(f32[64,128,768]{2,1,0} %multiply.661, f32[64,128,768]{2,1,0} %broadcast.1789), metadata={op_type="erf" op_name="pmap(eval_step)/erf" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=479}
  %multiply.660 = f32[64,128,768]{2,1,0} multiply(f32[64,128,768]{2,1,0} %clamp.18, f32[64,128,768]{2,1,0} %add.898), metadata={op_type="erf" op_name="pmap(eval_step)/erf" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=479}
  %constant_921 = f32[] constant(-1.45660715e-05), metadata={op_type="erf" op_name="pmap(eval_step)/erf" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=313}
  %broadcast.1788 = f32[64,128,768]{2,1,0} broadcast(f32[] %constant_921), dimensions={}, metadata={op_type="erf" op_name="pmap(eval_step)/erf" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=479}
  %add.896 = f32[64,128,768]{2,1,0} add(f32[64,128,768]{2,1,0} %multiply.667, f32[64,128,768]{2,1,0} %broadcast.1788), metadata={op_type="erf" op_name="pmap(eval_step)/erf" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=479}
  %multiply.659 = f32[64,128,768]{2,1,0} multiply(f32[64,128,768]{2,1,0} %add.896, f32[64,128,768]{2,1,0} %multiply.668), metadata={op_type="erf" op_name="pmap(eval_step)/erf" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=479}
  %constant_919 = f32[] constant(-0.000213374049), metadata={op_type="erf" op_name="pmap(eval_step)/erf" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=313}
  %broadcast.1787 = f32[64,128,768]{2,1,0} broadcast(f32[] %constant_919), dimensions={}, metadata={op_type="erf" op_name="pmap(eval_step)/erf" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=479}
  %add.895 = f32[64,128,768]{2,1,0} add(f32[64,128,768]{2,1,0} %multiply.659, f32[64,128,768]{2,1,0} %broadcast.1787), metadata={op_type="erf" op_name="pmap(eval_step)/erf" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=479}
  %multiply.658 = f32[64,128,768]{2,1,0} multiply(f32[64,128,768]{2,1,0} %add.895, f32[64,128,768]{2,1,0} %multiply.668), metadata={op_type="erf" op_name="pmap(eval_step)/erf" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=479}
  %constant_918 = f32[] constant(-0.00168282702), metadata={op_type="erf" op_name="pmap(eval_step)/erf" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=313}
  %broadcast.1785 = f32[64,128,768]{2,1,0} broadcast(f32[] %constant_918), dimensions={}, metadata={op_type="erf" op_name="pmap(eval_step)/erf" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=479}
  %add.894 = f32[64,128,768]{2,1,0} add(f32[64,128,768]{2,1,0} %multiply.658, f32[64,128,768]{2,1,0} %broadcast.1785), metadata={op_type="erf" op_name="pmap(eval_step)/erf" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=479}
  %multiply.657 = f32[64,128,768]{2,1,0} multiply(f32[64,128,768]{2,1,0} %add.894, f32[64,128,768]{2,1,0} %multiply.668), metadata={op_type="erf" op_name="pmap(eval_step)/erf" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=479}
  %constant_916 = f32[] constant(-0.00737332925), metadata={op_type="erf" op_name="pmap(eval_step)/erf" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=313}
  %broadcast.1784 = f32[64,128,768]{2,1,0} broadcast(f32[] %constant_916), dimensions={}, metadata={op_type="erf" op_name="pmap(eval_step)/erf" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=479}
  %add.893 = f32[64,128,768]{2,1,0} add(f32[64,128,768]{2,1,0} %multiply.657, f32[64,128,768]{2,1,0} %broadcast.1784), metadata={op_type="erf" op_name="pmap(eval_step)/erf" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=479}
  %multiply.656 = f32[64,128,768]{2,1,0} multiply(f32[64,128,768]{2,1,0} %add.893, f32[64,128,768]{2,1,0} %multiply.668), metadata={op_type="erf" op_name="pmap(eval_step)/erf" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=479}
  %constant_915 = f32[] constant(-0.0142647391), metadata={op_type="erf" op_name="pmap(eval_step)/erf" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=313}
  %broadcast.1783 = f32[64,128,768]{2,1,0} broadcast(f32[] %constant_915), dimensions={}, metadata={op_type="erf" op_name="pmap(eval_step)/erf" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=479}
  %add.892 = f32[64,128,768]{2,1,0} add(f32[64,128,768]{2,1,0} %multiply.656, f32[64,128,768]{2,1,0} %broadcast.1783), metadata={op_type="erf" op_name="pmap(eval_step)/erf" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=479}
  %divide.42 = f32[64,128,768]{2,1,0} divide(f32[64,128,768]{2,1,0} %multiply.660, f32[64,128,768]{2,1,0} %add.892), metadata={op_type="erf" op_name="pmap(eval_step)/erf" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=479}
  %constant_914 = f32[] constant(1), metadata={op_type="add" op_name="pmap(eval_step)/add" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=313}
  %broadcast.1781 = f32[64,128,768]{2,1,0} broadcast(f32[] %constant_914), dimensions={}, metadata={op_type="add" op_name="pmap(eval_step)/add" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=479}
  %add.891 = f32[64,128,768]{2,1,0} add(f32[64,128,768]{2,1,0} %divide.42, f32[64,128,768]{2,1,0} %broadcast.1781), metadata={op_type="add" op_name="pmap(eval_step)/add" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=479}
  %multiply.655 = f32[64,128,768]{2,1,0} multiply(f32[64,128,768]{2,1,0} %add.906, f32[64,128,768]{2,1,0} %add.891), metadata={op_type="mul" op_name="pmap(eval_step)/mul" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=479}
  %constant_913 = f32[] constant(0.5)
  %broadcast.1780 = f32[64,128,768]{2,1,0} broadcast(f32[] %constant_913), dimensions={}
  %multiply.654 = f32[64,128,768]{2,1,0} multiply(f32[64,128,768]{2,1,0} %multiply.655, f32[64,128,768]{2,1,0} %broadcast.1780), metadata={op_type="div" op_name="pmap(eval_step)/div" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=479}
  %param_3.728 = f32[64,128]{1,0} parameter(3)
  %constant_175 = f32[] constant(0.00130208337)
  %broadcast.915 = f32[64,128]{1,0} broadcast(f32[] %constant_175), dimensions={}
  %multiply.174 = f32[64,128]{1,0} multiply(f32[64,128]{1,0} %param_3.728, f32[64,128]{1,0} %broadcast.915), metadata={op_type="div" op_name="pmap(eval_step)/div" source_file="/usr/local/lib/python3.8/dist-packages/flax/linen/normalization.py" source_line=185}
  %broadcast.607 = f32[64,128,768]{2,1,0} broadcast(f32[64,128]{1,0} %multiply.174), dimensions={0,1}, metadata={op_type="sub" op_name="pmap(eval_step)/sub" source_file="/usr/local/lib/python3.8/dist-packages/flax/linen/normalization.py" source_line=193}
  %subtract.29 = f32[64,128,768]{2,1,0} subtract(f32[64,128,768]{2,1,0} %multiply.654, f32[64,128,768]{2,1,0} %broadcast.607), metadata={op_type="sub" op_name="pmap(eval_step)/sub" source_file="/usr/local/lib/python3.8/dist-packages/flax/linen/normalization.py" source_line=193}
  %param_2.319 = f32[64,128]{1,0} parameter(2)
  %multiply.173 = f32[64,128]{1,0} multiply(f32[64,128]{1,0} %param_2.319, f32[64,128]{1,0} %broadcast.915), metadata={op_type="div" op_name="pmap(eval_step)/div" source_file="/usr/local/lib/python3.8/dist-packages/flax/linen/normalization.py" source_line=186}
  %multiply.172 = f32[64,128]{1,0} multiply(f32[64,128]{1,0} %multiply.174, f32[64,128]{1,0} %multiply.174), metadata={op_type="integer_pow" op_name="pmap(eval_step)/integer_pow[ y=2 ]" source_file="/usr/local/lib/python3.8/dist-packages/flax/linen/normalization.py" source_line=187}
  %subtract.28 = f32[64,128]{1,0} subtract(f32[64,128]{1,0} %multiply.173, f32[64,128]{1,0} %multiply.172), metadata={op_type="sub" op_name="pmap(eval_step)/sub" source_file="/usr/local/lib/python3.8/dist-packages/flax/linen/normalization.py" source_line=187}
  %constant_176 = f32[] constant(1e-05), metadata={op_type="add" op_name="pmap(eval_step)/add" source_file="/usr/local/lib/python3.8/dist-packages/flax/linen/normalization.py" source_line=188}
  %broadcast.917 = f32[64,128]{1,0} broadcast(f32[] %constant_176), dimensions={}, metadata={op_type="add" op_name="pmap(eval_step)/add" source_file="/usr/local/lib/python3.8/dist-packages/flax/linen/normalization.py" source_line=188}
  %add.51 = f32[64,128]{1,0} add(f32[64,128]{1,0} %subtract.28, f32[64,128]{1,0} %broadcast.917), metadata={op_type="add" op_name="pmap(eval_step)/add" source_file="/usr/local/lib/python3.8/dist-packages/flax/linen/normalization.py" source_line=188}
  %rsqrt.26 = f32[64,128]{1,0} rsqrt(f32[64,128]{1,0} %add.51), metadata={op_type="rsqrt" op_name="pmap(eval_step)/rsqrt" source_file="/usr/local/lib/python3.8/dist-packages/flax/linen/normalization.py" source_line=188}
  %broadcast.606 = f32[64,128,768]{2,1,0} broadcast(f32[64,128]{1,0} %rsqrt.26), dimensions={0,1}, metadata={op_type="mul" op_name="pmap(eval_step)/mul" source_file="/usr/local/lib/python3.8/dist-packages/flax/linen/normalization.py" source_line=190}
  %param_1.30 = f32[768]{0} parameter(1)
  %broadcast.604 = f32[64,128,768]{2,1,0} broadcast(f32[768]{0} %param_1.30), dimensions={2}, metadata={op_type="mul" op_name="pmap(eval_step)/mul" source_file="/usr/local/lib/python3.8/dist-packages/flax/linen/normalization.py" source_line=190}
  %multiply.171 = f32[64,128,768]{2,1,0} multiply(f32[64,128,768]{2,1,0} %broadcast.606, f32[64,128,768]{2,1,0} %broadcast.604), metadata={op_type="mul" op_name="pmap(eval_step)/mul" source_file="/usr/local/lib/python3.8/dist-packages/flax/linen/normalization.py" source_line=190}
  %multiply.170 = f32[64,128,768]{2,1,0} multiply(f32[64,128,768]{2,1,0} %subtract.29, f32[64,128,768]{2,1,0} %multiply.171), metadata={op_type="mul" op_name="pmap(eval_step)/mul" source_file="/usr/local/lib/python3.8/dist-packages/flax/linen/normalization.py" source_line=193}
  %param_0.21 = f32[768]{0} parameter(0)
  %broadcast.603 = f32[64,128,768]{2,1,0} broadcast(f32[768]{0} %param_0.21), dimensions={2}, metadata={op_type="add" op_name="pmap(eval_step)/add" source_file="/usr/local/lib/python3.8/dist-packages/flax/linen/normalization.py" source_line=195}
  %add.50 = f32[64,128,768]{2,1,0} add(f32[64,128,768]{2,1,0} %multiply.170, f32[64,128,768]{2,1,0} %broadcast.603), metadata={op_type="add" op_name="pmap(eval_step)/add" source_file="/usr/local/lib/python3.8/dist-packages/flax/linen/normalization.py" source_line=195}
  ROOT %bitcast.133 = f32[8192,768]{1,0} bitcast(f32[64,128,768]{2,1,0} %add.50)
}

%fused_computation.11 (param_0.28: f32[768], param_1.40: f32[768], param_2.323: f32[64,128], param_3.700: f32[64,128], param_4.589: f32[64,128,768], param_5.591: f32[768], param_6.506: f32[8192,768]) -> f32[8192,768] {
  %param_6.506 = f32[8192,768]{1,0} parameter(6)
  %bitcast.377 = f32[64,128,768]{2,1,0} bitcast(f32[8192,768]{1,0} %param_6.506), metadata={op_type="dot_general" op_name="pmap(eval_step)/dot_general[ dimension_numbers=(((2,), (0,)), ((), ()))\n                             precision=None\n                             preferred_element_type=None ]" source_file="/usr/local/lib/python3.8/dist-packages/flax/linen/linear.py" source_line=175}
  %param_5.591 = f32[768]{0} parameter(5)
  %broadcast.1655 = f32[64,128,768]{2,1,0} broadcast(f32[768]{0} %param_5.591), dimensions={2}, metadata={op_type="add" op_name="pmap(eval_step)/add" source_file="/usr/local/lib/python3.8/dist-packages/flax/linen/linear.py" source_line=181}
  %add.805 = f32[64,128,768]{2,1,0} add(f32[64,128,768]{2,1,0} %bitcast.377, f32[64,128,768]{2,1,0} %broadcast.1655), metadata={op_type="add" op_name="pmap(eval_step)/add" source_file="/usr/local/lib/python3.8/dist-packages/flax/linen/linear.py" source_line=181}
  %param_4.589 = f32[64,128,768]{2,1,0} parameter(4)
  %add.804 = f32[64,128,768]{2,1,0} add(f32[64,128,768]{2,1,0} %add.805, f32[64,128,768]{2,1,0} %param_4.589), metadata={op_type="add" op_name="pmap(eval_step)/add" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=334}
  %param_3.700 = f32[64,128]{1,0} parameter(3)
  %constant_196 = f32[] constant(0.00130208337)
  %broadcast.919 = f32[64,128]{1,0} broadcast(f32[] %constant_196), dimensions={}
  %multiply.196 = f32[64,128]{1,0} multiply(f32[64,128]{1,0} %param_3.700, f32[64,128]{1,0} %broadcast.919), metadata={op_type="div" op_name="pmap(eval_step)/div" source_file="/usr/local/lib/python3.8/dist-packages/flax/linen/normalization.py" source_line=185}
  %broadcast.636 = f32[64,128,768]{2,1,0} broadcast(f32[64,128]{1,0} %multiply.196), dimensions={0,1}, metadata={op_type="sub" op_name="pmap(eval_step)/sub" source_file="/usr/local/lib/python3.8/dist-packages/flax/linen/normalization.py" source_line=193}
  %subtract.31 = f32[64,128,768]{2,1,0} subtract(f32[64,128,768]{2,1,0} %add.804, f32[64,128,768]{2,1,0} %broadcast.636), metadata={op_type="sub" op_name="pmap(eval_step)/sub" source_file="/usr/local/lib/python3.8/dist-packages/flax/linen/normalization.py" source_line=193}
  %param_2.323 = f32[64,128]{1,0} parameter(2)
  %multiply.195 = f32[64,128]{1,0} multiply(f32[64,128]{1,0} %param_2.323, f32[64,128]{1,0} %broadcast.919), metadata={op_type="div" op_name="pmap(eval_step)/div" source_file="/usr/local/lib/python3.8/dist-packages/flax/linen/normalization.py" source_line=186}
  %multiply.194 = f32[64,128]{1,0} multiply(f32[64,128]{1,0} %multiply.196, f32[64,128]{1,0} %multiply.196), metadata={op_type="integer_pow" op_name="pmap(eval_step)/integer_pow[ y=2 ]" source_file="/usr/local/lib/python3.8/dist-packages/flax/linen/normalization.py" source_line=187}
  %subtract.30 = f32[64,128]{1,0} subtract(f32[64,128]{1,0} %multiply.195, f32[64,128]{1,0} %multiply.194), metadata={op_type="sub" op_name="pmap(eval_step)/sub" source_file="/usr/local/lib/python3.8/dist-packages/flax/linen/normalization.py" source_line=187}
  %constant_197 = f32[] constant(1e-05), metadata={op_type="add" op_name="pmap(eval_step)/add" source_file="/usr/local/lib/python3.8/dist-packages/flax/linen/normalization.py" source_line=188}
  %broadcast.920 = f32[64,128]{1,0} broadcast(f32[] %constant_197), dimensions={}, metadata={op_type="add" op_name="pmap(eval_step)/add" source_file="/usr/local/lib/python3.8/dist-packages/flax/linen/normalization.py" source_line=188}
  %add.67 = f32[64,128]{1,0} add(f32[64,128]{1,0} %subtract.30, f32[64,128]{1,0} %broadcast.920), metadata={op_type="add" op_name="pmap(eval_step)/add" source_file="/usr/local/lib/python3.8/dist-packages/flax/linen/normalization.py" source_line=188}
  %rsqrt.27 = f32[64,128]{1,0} rsqrt(f32[64,128]{1,0} %add.67), metadata={op_type="rsqrt" op_name="pmap(eval_step)/rsqrt" source_file="/usr/local/lib/python3.8/dist-packages/flax/linen/normalization.py" source_line=188}
  %broadcast.635 = f32[64,128,768]{2,1,0} broadcast(f32[64,128]{1,0} %rsqrt.27), dimensions={0,1}, metadata={op_type="mul" op_name="pmap(eval_step)/mul" source_file="/usr/local/lib/python3.8/dist-packages/flax/linen/normalization.py" source_line=190}
  %param_1.40 = f32[768]{0} parameter(1)
  %broadcast.634 = f32[64,128,768]{2,1,0} broadcast(f32[768]{0} %param_1.40), dimensions={2}, metadata={op_type="mul" op_name="pmap(eval_step)/mul" source_file="/usr/local/lib/python3.8/dist-packages/flax/linen/normalization.py" source_line=190}
  %multiply.193 = f32[64,128,768]{2,1,0} multiply(f32[64,128,768]{2,1,0} %broadcast.635, f32[64,128,768]{2,1,0} %broadcast.634), metadata={op_type="mul" op_name="pmap(eval_step)/mul" source_file="/usr/local/lib/python3.8/dist-packages/flax/linen/normalization.py" source_line=190}
  %multiply.192 = f32[64,128,768]{2,1,0} multiply(f32[64,128,768]{2,1,0} %subtract.31, f32[64,128,768]{2,1,0} %multiply.193), metadata={op_type="mul" op_name="pmap(eval_step)/mul" source_file="/usr/local/lib/python3.8/dist-packages/flax/linen/normalization.py" source_line=193}
  %param_0.28 = f32[768]{0} parameter(0)
  %broadcast.633 = f32[64,128,768]{2,1,0} broadcast(f32[768]{0} %param_0.28), dimensions={2}, metadata={op_type="add" op_name="pmap(eval_step)/add" source_file="/usr/local/lib/python3.8/dist-packages/flax/linen/normalization.py" source_line=195}
  %add.66 = f32[64,128,768]{2,1,0} add(f32[64,128,768]{2,1,0} %multiply.192, f32[64,128,768]{2,1,0} %broadcast.633), metadata={op_type="add" op_name="pmap(eval_step)/add" source_file="/usr/local/lib/python3.8/dist-packages/flax/linen/normalization.py" source_line=195}
  ROOT %bitcast.135 = f32[8192,768]{1,0} bitcast(f32[64,128,768]{2,1,0} %add.66)
}

%fused_computation.14 (param_0.467: f32[3072], param_1.502: f32[8192,3072]) -> f32[8192,3072] {
  %param_1.502 = f32[8192,3072]{1,0} parameter(1)
  %bitcast.138 = f32[64,128,3072]{2,1,0} bitcast(f32[8192,3072]{1,0} %param_1.502), metadata={op_type="dot_general" op_name="pmap(eval_step)/dot_general[ dimension_numbers=(((2,), (0,)), ((), ()))\n                             precision=None\n                             preferred_element_type=None ]" source_file="/usr/local/lib/python3.8/dist-packages/flax/linen/linear.py" source_line=175}
  %param_0.467 = f32[3072]{0} parameter(0)
  %broadcast.639 = f32[64,128,3072]{2,1,0} broadcast(f32[3072]{0} %param_0.467), dimensions={2}, metadata={op_type="add" op_name="pmap(eval_step)/add" source_file="/usr/local/lib/python3.8/dist-packages/flax/linen/linear.py" source_line=181}
  %add.83 = f32[64,128,3072]{2,1,0} add(f32[64,128,3072]{2,1,0} %bitcast.138, f32[64,128,3072]{2,1,0} %broadcast.639), metadata={op_type="add" op_name="pmap(eval_step)/add" source_file="/usr/local/lib/python3.8/dist-packages/flax/linen/linear.py" source_line=181}
  %constant_199 = f32[] constant(-4), metadata={op_type="erf" op_name="pmap(eval_step)/erf" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=313}
  %broadcast.925 = f32[64,128,3072]{2,1,0} broadcast(f32[] %constant_199), dimensions={}, metadata={op_type="erf" op_name="pmap(eval_step)/erf" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=313}
  %constant_200 = f32[] constant(0.707106769)
  %broadcast.922 = f32[64,128,3072]{2,1,0} broadcast(f32[] %constant_200), dimensions={}
  %multiply.213 = f32[64,128,3072]{2,1,0} multiply(f32[64,128,3072]{2,1,0} %add.83, f32[64,128,3072]{2,1,0} %broadcast.922), metadata={op_type="div" op_name="pmap(eval_step)/div" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=313}
  %constant_201 = f32[] constant(4), metadata={op_type="erf" op_name="pmap(eval_step)/erf" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=313}
  %broadcast.923 = f32[64,128,3072]{2,1,0} broadcast(f32[] %constant_201), dimensions={}, metadata={op_type="erf" op_name="pmap(eval_step)/erf" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=313}
  %clamp.1 = f32[64,128,3072]{2,1,0} clamp(f32[64,128,3072]{2,1,0} %broadcast.925, f32[64,128,3072]{2,1,0} %multiply.213, f32[64,128,3072]{2,1,0} %broadcast.923), metadata={op_type="erf" op_name="pmap(eval_step)/erf" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=313}
  %constant_221 = f32[] constant(0), metadata={op_type="reduce_sum" op_name="pmap(eval_step)/reduce_sum[ axes=(2,) ]" source_file="/usr/local/lib/python3.8/dist-packages/flax/linen/normalization.py" source_line=185}
  %broadcast.926 = f32[64,128,3072]{2,1,0} broadcast(f32[] %constant_221), dimensions={}, metadata={op_type="erf" op_name="pmap(eval_step)/erf" source_file="/usr/local/lib/python3.8/dist-packages/transformers/models/roberta/modeling_flax_roberta.py" source_line=313}
